# Задача 14 - про степени двойки не более заданного числа
n = int(input('Введите число: n = '))
for i in range(n + 1):
    f = 2 ** i
    if f <= n:
        print(f'   i = {i},   2^{i} = {f}')        
print('end')
